app/Controllers/Home.php

    public function index()
    {
        // 1. Modelimizi çalıştırıyoruz
        $urunModel = new UrunModel();

        // 2. Veritabanındaki tüm ürünleri çekip 'urunler' adında bir pakete koyuyoruz
        $veri['urunler'] = $urunModel->findAll();
---
SELECT *
FROM `urunler`